nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/common/pin_mux/pin_mux.h
/* GPIO_EMC_B1_25 (coord N3), SEMC_RAS/U14[18]/U16[18]/ENET2_RGMII_TXD2 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_SIGNAL                             semc_ras   /*!< Signal name */

/* GPIO_EMC_B1_28 (coord F5), SEMC_WE/U14[16]/U16[16] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_WE_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_WE_SIGNAL                               semc_we   /*!< Signal name */

/* GPIO_EMC_B1_21 (coord K4), SEMC_BA0/U14[20]/U16[20]/ENET2_RGMII_RXC */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA0_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_SIGNAL                                   BA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord L3), SEMC_BA1/U14[21]/U16[21]/ENET2_RGMII_RXD2 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA1_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_SIGNAL                                   BA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_EMC_B1_24 (coord P2), SEMC_CAS/U14[17]/U16[17]/ENET2_RGMII_TXD3 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CAS_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CAS_SIGNAL                             semc_cas   /*!< Signal name */

/* GPIO_EMC_B1_27 (coord J3), SEMC_CKE/U14[37]/U16[37] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CKE_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CKE_SIGNAL                             semc_cke   /*!< Signal name */

/* GPIO_EMC_B1_26 (coord N4), SEMC_CLK/U14[38]/U16[38] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_SIGNAL                             semc_clk   /*!< Signal name */

/* GPIO_EMC_B1_29 (coord E4), SEMC_CS0/U14[19]/U16[19] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CS0_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CS0_SIGNAL                                   CS   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_CS0_CHANNEL                                  0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);               /* Function assigned for the Cortex-M33 */

/* GPIO_AON_18 (coord E6), INT2_COMBO/DC_INT/CAN3_TX/U42[1]/J47[3]/U115[6] */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN3_TX_PERIPHERAL                                CAN3   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN3_TX_SIGNAL                                      TX   /*!< Signal name */

/* GPIO_AON_03 (coord C8), CAN3_RX/U42[4] */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN3_RX_PERIPHERAL                                CAN3   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN3_RX_SIGNAL                                      RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);                 /* Function assigned for the Cortex-M33 */

/* GPIO_AD_15 (coord N16), SD1_CD_B/SPDIF_IN/Flash_RST/J39[6]/J69[18]/J70[2]/J15[9]/J25[1]/U361F[13] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_CD_B_PERIPHERAL                            RGPIO4   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_CD_B_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_CD_B_CHANNEL                                  15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD1_CD_B_GPIO                                  RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD1_CD_B_GPIO_PIN                                 15U   /*!< GPIO pin number */
#define BOARD_INITSDHCPINS_SD1_CD_B_GPIO_PIN_MASK                    (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_14 (coord N14), SD_PWREN_B/SPDIF_EXT_CLK/J69[17]/Q6[1] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PERIPHERAL                          RGPIO4   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_CHANNEL                                14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO                                RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO_PIN                               14U   /*!< GPIO pin number */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO_PIN_MASK                  (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_AD_29 (coord L15), SD1_VSELECT/Q5[2] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_VSELECT_PERIPHERAL                         RGPIO4   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_VSELECT_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_VSELECT_CHANNEL                               29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD1_VSELECT_GPIO                               RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD1_VSELECT_GPIO_PIN                              29U   /*!< GPIO pin number */
#define BOARD_INITSDHCPINS_SD1_VSELECT_GPIO_PIN_MASK                 (1U << 29U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);                /* Function assigned for the Cortex-M33 */

