nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/common/pin_mux/pin_mux.h
/* GPIO_AD_30 (coord L17), NETC_ECAT_MDC/PHY2_RGMII_MDC/PHY3_RGMII_MDC/J44[9]/U121[22]/U123[22]/U125[1]/U29[13]/U34[13] */
/* Routed pin properties */
#define BOARD_INITNETPINS_NETC_ECAT_MDC_PERIPHERAL                          NETC   /*!< Peripheral name */
#define BOARD_INITNETPINS_NETC_ECAT_MDC_SIGNAL                         netc_emdc   /*!< Signal name */

/* GPIO_AD_31 (coord K17), NETC_ECAT_MDIO/PHY2_RGMII_MDIO/PHY3_RGMII_MDIO/U121[23]/U123[23]/U125[8]/U29[14]/U34[14] */
/* Routed pin properties */
#define BOARD_INITNETPINS_NETC_ECAT_MDIO_PERIPHERAL                         NETC   /*!< Peripheral name */
#define BOARD_INITNETPINS_NETC_ECAT_MDIO_SIGNAL                       netc_emdio   /*!< Signal name */

/* GPIO_B1_13 (coord B11), ENET1_RST_B/U27[12] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RST_B_PERIPHERAL                          RGPIO6   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RST_B_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RST_B_CHANNEL                                13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITNETPINS_ENET1_RST_B_GPIO                                RGPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITNETPINS_ENET1_RST_B_GPIO_PIN                               13U   /*!< GPIO pin number */
#define BOARD_INITNETPINS_ENET1_RST_B_GPIO_PIN_MASK                  (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_AD_25 (coord M15), ENET0_RST_B/PHY0_RST_B/U121[21] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_RST_B_PERIPHERAL                          RGPIO4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_RST_B_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITNETPINS_ENET0_RST_B_CHANNEL                                25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITNETPINS_ENET0_RST_B_GPIO                                RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITNETPINS_ENET0_RST_B_GPIO_PIN                               25U   /*!< GPIO pin number */
#define BOARD_INITNETPINS_ENET0_RST_B_GPIO_PIN_MASK                  (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_AD_13 (coord N15), SPDIF_SR_CLK/ENET4_RST_B/PHY4_RST_B/U123[21]/J39[12]/J69[16] */
/* Routed pin properties */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_PERIPHERAL                         RGPIO4   /*!< Peripheral name */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_CHANNEL                               13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_GPIO                               RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_GPIO_PIN                              13U   /*!< GPIO pin number */
#define BOARD_INITNETPINS_SPDIF_SR_CLK_GPIO_PIN_MASK                 (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_07 (coord T7), SEMC_D23/U16[13]/ENET0_TXEN/PHY0_TXEN/U121[20] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_TXEN_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_TXEN_SIGNAL                                TX_EN   /*!< Signal name */

/* GPIO_EMC_B2_08 (coord U4), SEMC_DM2/U16[15]/ENET0_TX_REF_CLK/PHY0_TXC/U121[15]/U16[15] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_TX_REF_CLK_PERIPHERAL              NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_TX_REF_CLK_SIGNAL                         TX_CLK   /*!< Signal name */

/* GPIO_EMC_B2_05 (coord T4), SEMC_D21/U16[10]/ENET0_TXD0/PHY0_TXD0/U121[16] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_TXD0_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_TXD0_SIGNAL                              TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET0_TXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_EMC_B2_06 (coord T6), SEMC_D22/U16[11]/ENET0_TXD1/PHY0_TXD1/U121[17] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_TXD1_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_TXD1_SIGNAL                              TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET0_TXD1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_EMC_B2_11 (coord P6), SEMC_D26/U16[45]/ENET0_CRS_DV/PHY0_CRS_DV/U121[26] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_CRS_DV_PERIPHERAL                  NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_CRS_DV_SIGNAL                              RX_EN   /*!< Signal name */

/* GPIO_EMC_B2_12 (coord R5), SEMC_D27/U16[47]/ENET0_RXER/PHY0_RXER/FXEN/U121[28] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_RXER_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_RXER_SIGNAL                                RX_ER   /*!< Signal name */

/* GPIO_EMC_B2_09 (coord U5), SEMC_D24/U16[42]/ENET0_RXD0/PHY0_RXD0/U121[9] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_RXD0_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_RXD0_SIGNAL                              RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET0_RXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_EMC_B2_10 (coord U6), SEMC_D25/U16[44]/ENET0_RXD1/PHY0_RXD1/U121[10] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET0_RXD1_PERIPHERAL                    NETC_SWT_ETH0   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET0_RXD1_SIGNAL                              RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET0_RXD1_CHANNEL                                  1U   /*!< Signal channel */

