nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/common/pin_mux/pin_mux.h
/* GPIO_B1_03 (coord A14), ENET1_RGMII_TXC/PHY1_RGMII_TXC/ECAT_SYNC0/U27[20]/Q19[1] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TXC_PERIPHERAL               NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXC_SIGNAL                          TX_CLK   /*!< Signal name */

/* GPIO_B1_02 (coord E12), ENET1_RGMII_TX_EN/PHY1_RGMII_TX_EN/ECAT_SYNC1/U27[19]/Q20[1] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TX_EN_PERIPHERAL             NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TX_EN_SIGNAL                         TX_EN   /*!< Signal name */

/* GPIO_B1_00 (coord E13), ENET1_RGMII_TXD0/PHY1_RGMII_TXD0/ECAT_ACT0/U27[18]/Q21[1] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD0_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD0_SIGNAL                        TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD0_CHANNEL                            0U   /*!< Signal channel */

/* GPIO_B1_01 (coord C12), ENET1_RGMII_TXD1/PHY1_RGMII_TXD1/ECAT_ACT1/U27[17]/Q23[1] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD1_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD1_SIGNAL                        TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD1_CHANNEL                            1U   /*!< Signal channel */

/* GPIO_B1_07 (coord D13), ENET1_RGMII_TXD2/PHY1_RGMII_TXD2/U27[16] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD2_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD2_SIGNAL                        TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD2_CHANNEL                            2U   /*!< Signal channel */

/* GPIO_B1_08 (coord B14), ENET1_RGMII_TXD3/PHY1_RGMII_TXD3/U27[15] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD3_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD3_SIGNAL                        TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_TXD3_CHANNEL                            3U   /*!< Signal channel */

/* GPIO_B1_11 (coord A12), ENET1_RGMII_RXC/PHY1_RGMII_RXC/RXC_PHYAD1_1/U27[27] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RXC_PERIPHERAL               NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXC_SIGNAL                          RX_CLK   /*!< Signal name */

/* GPIO_B1_06 (coord B10), ENET1_RGMII_RX_EN/PHY1_RGMII_RX_EN/RXCTL_PHYAD2_1/U27[26] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RX_EN_PERIPHERAL             NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RX_EN_SIGNAL                         RX_EN   /*!< Signal name */

/* GPIO_B1_04 (coord B13), ENET1_RGMII_RXD0/PHY1_RGMII_RXD0/RXD0_RXDLY_1/U27[25] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD0_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD0_SIGNAL                        RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD0_CHANNEL                            0U   /*!< Signal channel */

/* GPIO_B1_05 (coord B12), ENET1_RGMII_RXD1/PHY1_RGMII_RXD1/RXD1_TXDLY_1/U27[24] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD1_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD1_SIGNAL                        RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD1_CHANNEL                            1U   /*!< Signal channel */

/* GPIO_B1_09 (coord A15), ENET1_RGMII_RXD2/PHY1_RGMII_RXD2/RXD2_PLLOFF_1/U27[23] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD2_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD2_SIGNAL                        RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD2_CHANNEL                            2U   /*!< Signal channel */

/* GPIO_B1_10 (coord A13), ENET1_RGMII_RXD3/PHY1_RGMII_RXD3/RXD3_PHYAD0_1/U27[22] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD3_PERIPHERAL              NETC_SWT_ETH1   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD3_SIGNAL                        RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET1_RGMII_RXD3_CHANNEL                            3U   /*!< Signal channel */

/* GPIO_EMC_B2_15 (coord R4), SEMC_D30/U16[51]/ENET4_TXEN/PHY4_TXEN/U123[20] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_TXEN_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_TXEN_SIGNAL                                TX_EN   /*!< Signal name */

/* GPIO_EMC_B2_16 (coord R7), SEMC_D31/U16[53]/ENET4_TX_REF_CLK/PHY4_TXC/U123[15] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_TX_REF_CLK_PERIPHERAL           NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_TX_REF_CLK_SIGNAL                         TX_CLK   /*!< Signal name */

/* GPIO_EMC_B2_13 (coord R6), SEMC_D28/U16[48]/ENET4_TXD0/PHY4_TXD0/U123[16] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_TXD0_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_TXD0_SIGNAL                              TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET4_TXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_EMC_B2_14 (coord N8), SEMC_D29/U16[50]/ENET4_TXD1/PHY4_TXD1/U123[17] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_TXD1_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_TXD1_SIGNAL                              TX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET4_TXD1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_EMC_B2_19 (coord U8), ENET4_CRS_DV/PHY4_CRS_DV/U123[26] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_CRS_DV_PERIPHERAL               NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_CRS_DV_SIGNAL                              RX_EN   /*!< Signal name */

/* GPIO_EMC_B2_20 (coord R8), ENET4_RXER/PHY4_RXER/FXEN/U123[28] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_RXER_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_RXER_SIGNAL                                RX_ER   /*!< Signal name */

