nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/common/pin_mux/pin_mux.h
/* GPIO_EMC_B2_17 (coord U7), SEMC_DM3/U16[39]/ENET4_RXD0/PHY4_RXD0/U123[9] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_RXD0_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_RXD0_SIGNAL                              RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET4_RXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_EMC_B2_18 (coord P8), ENET4_RXD1/PHY4_RXD1/U123[10] */
/* Routed pin properties */
#define BOARD_INITNETPINS_ENET4_RXD1_PERIPHERAL                 NETC_ENETC0_ETH4   /*!< Peripheral name */
#define BOARD_INITNETPINS_ENET4_RXD1_SIGNAL                              RX_DATA   /*!< Signal name */
#define BOARD_INITNETPINS_ENET4_RXD1_CHANNEL                                  1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitNETPins(void);                 /* Function assigned for the Cortex-M33 */

/* GPIO_B2_10 (coord A10), FlexSPI1_A_D0/U70[8] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D0_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D0_SIGNAL                 FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_B2_11 (coord B9), FlexSPI1_A_D1/U70[7] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D1_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D1_SIGNAL                 FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_B2_12 (coord A8), FlexSPI1_A_D2/U71[8] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D2_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D2_SIGNAL                 FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_B2_13 (coord B8), FlexSPI1_A_D3/U71[7] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D3_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_D3_SIGNAL                 FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_B2_07 (coord A6), FlexSPI1_A_DQS/U11[C3] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_DQS_PERIPHERAL                   FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_DQS_SIGNAL                  FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_B2_08 (coord A7), FlexSPI1_A_CLK/U69[7] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_CLK_PERIPHERAL                   FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_CLK_SIGNAL                 FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_B2_09 (coord D10), FlexSPI1_A_SS0/U69[8] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI1_A_SS0_PERIPHERAL                   FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI1_A_SS0_SIGNAL                FLEXSPI_A_SS0_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASHPins(void);               /* Function assigned for the Cortex-M33 */

/* GPIO_AON_16 (coord C5), LPI2C2_SCL/J44[20]/U126[1]/U115[5]/U369[F1]/U134[54] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_LPI2C2_SCL_PERIPHERAL                           LPI2C2   /*!< Peripheral name */
#define BOARD_INITI2SPINS_LPI2C2_SCL_SIGNAL                                  SCL   /*!< Signal name */

/* GPIO_AON_15 (coord B3), LPI2C2_SDA/J44[18]/U126[8]/U115[4]/U369[E2]/J134[52] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_LPI2C2_SDA_PERIPHERAL                           LPI2C2   /*!< Peripheral name */
#define BOARD_INITI2SPINS_LPI2C2_SDA_SIGNAL                                  SDA   /*!< Signal name */

/* GPIO_AON_21 (coord F6), SAI1_TXD0/DC_I2S1_TX_D0/J100[1]/J47[17] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI1_TXD0_PERIPHERAL                              SAI1   /*!< Peripheral name */
#define BOARD_INITI2SPINS_SAI1_TXD0_SIGNAL                          sai_tx_data0   /*!< Signal name */

/* GPIO_AON_22 (coord C3), SAI1_TX_SYNC/DC_I2S1_TX_SYNC/J97[1]/J47[16] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI1_TX_SYNC_PERIPHERAL                           SAI1   /*!< Peripheral name */
#define BOARD_INITI2SPINS_SAI1_TX_SYNC_SIGNAL                        sai_tx_sync   /*!< Signal name */

/* GPIO_AON_23 (coord C2), SAI1_TX_BCLK/DC_I2S1_TX_BCLK/J98[1]/J47[23] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI1_TX_BCLK_PERIPHERAL                           SAI1   /*!< Peripheral name */
#define BOARD_INITI2SPINS_SAI1_TX_BCLK_SIGNAL                        sai_tx_bclk   /*!< Signal name */

/* GPIO_AON_24 (coord C1), SAI1_MCLK/DC_I2S1_MCLK/J47[1]/U369[G7] */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI1_MCLK_PERIPHERAL                              SAI1   /*!< Peripheral name */
#define BOARD_INITI2SPINS_SAI1_MCLK_SIGNAL                              sai_mclk   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void);                 /* Function assigned for the Cortex-M33 */

/* GPIO_AD_17 (coord M17), WL_RST/I3C2_PUR/ECAT_LINK1/J69[20]/J36[56]/J50[3]/U46[14]/U123[25] */
/* Routed pin properties */
#define BOARD_INITI3CPINS_WL_RST_PERIPHERAL                                 I3C2   /*!< Peripheral name */
#define BOARD_INITI3CPINS_WL_RST_SIGNAL                                  i3c_pur   /*!< Signal name */

/* GPIO_AD_18 (coord K16), I3C2_SCL/LPI2C3_eCAT_SCL/BT_WAKE_B_3V3/J41[12]/J70[5]/J50[1]/U46[13]/J51[3]/J36[20]/U48[6]/J47[13] */
/* Routed pin properties */
#define BOARD_INITI3CPINS_I3C2_SCL_PERIPHERAL                               I3C2   /*!< Peripheral name */
#define BOARD_INITI3CPINS_I3C2_SCL_SIGNAL                                i3c_scl   /*!< Signal name */

/* GPIO_AD_19 (coord L13), I3C2_SDA/LPI2C3_eCAT_SDA/J41[10]/J70[6]/J50[2]/U46[14]/J51[5]/U48[5]/J47[15] */
/* Routed pin properties */
#define BOARD_INITI3CPINS_I3C2_SDA_PERIPHERAL                               I3C2   /*!< Peripheral name */
#define BOARD_INITI3CPINS_I3C2_SDA_SIGNAL                                i3c_sda   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI3CPins(void);                 /* Function assigned for the Cortex-M33 */

/* GPIO_AON_04 (coord B4), LPSPI1_SCK/HP_DET_B/GPIO_BUTTON/U13[6]/J101[6] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_LPSPI1_SCK_PERIPHERAL                           LPSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_LPSPI1_SCK_SIGNAL                                  SCK   /*!< Signal name */

