nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/common/pin_mux/pin_mux.h
/* GPIO_AON_05 (coord C7), LPSPI1_PCS0/AUD_INT/U13[1] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_LPSPI1_PCS0_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_LPSPI1_PCS0_SIGNAL                                PCS0   /*!< Signal name */

/* GPIO_AON_06 (coord E7), LPSPI1_SDO/CAN1_TX/U13[5]/U41[1] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_LPSPI1_SDO_PERIPHERAL                           LPSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_LPSPI1_SDO_SIGNAL                                 SOUT   /*!< Signal name */

/* GPIO_AON_07 (coord C6), LPSPI1_SDI/CAN1_RX/U13[2]/U41[4] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_LPSPI1_SDI_PERIPHERAL                           LPSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_LPSPI1_SDI_SIGNAL                                  SIN   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);                 /* Function assigned for the Cortex-M33 */

/* GPIO_AD_00 (coord N12), DMIC_CLK/CAN_STBY/U116[4]/U117[4]/U118[4]/U119[4]/U41[8]/U42[8]/J45[15]/J69[3] */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_CLK_PERIPHERAL                               PDM   /*!< Peripheral name */
#define BOARD_INITDMICPINS_DMIC_CLK_SIGNAL                                   CLK   /*!< Signal name */

/* GPIO_AD_01 (coord R14), DMIC_DATA0/U116[1]/J45[13]/J69[4] */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_DATA0_PERIPHERAL                             PDM   /*!< Peripheral name */
#define BOARD_INITDMICPINS_DMIC_DATA0_SIGNAL                       mic_bitstream   /*!< Signal name */
#define BOARD_INITDMICPINS_DMIC_DATA0_CHANNEL                                 0U   /*!< Signal channel */

/* GPIO_AD_02 (coord R13), DMIC_DATA1/U118[1]/J45[11]/J69[5]/J41[2]/J67[6] */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_DATA1_PERIPHERAL                             PDM   /*!< Peripheral name */
#define BOARD_INITDMICPINS_DMIC_DATA1_SIGNAL                       mic_bitstream   /*!< Signal name */
#define BOARD_INITDMICPINS_DMIC_DATA1_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_03 (coord R15), DMIC_DATA2/U117[1]/J45[9]/J69[6]/J41[4]/J67[8] */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_DATA2_PERIPHERAL                             PDM   /*!< Peripheral name */
#define BOARD_INITDMICPINS_DMIC_DATA2_SIGNAL                       mic_bitstream   /*!< Signal name */
#define BOARD_INITDMICPINS_DMIC_DATA2_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_04 (coord P15), DMIC_DATA3/U119[1]/J45[5]/J69[7]/J41[6]/J67[10] */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_DATA3_PERIPHERAL                             PDM   /*!< Peripheral name */
#define BOARD_INITDMICPINS_DMIC_DATA3_SIGNAL                       mic_bitstream   /*!< Signal name */
#define BOARD_INITDMICPINS_DMIC_DATA3_CHANNEL                                 3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void);                /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
